# Users Favorite Books

<img src="books model png.png">

## Imports

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/17175/.secret/mysql.json')as f:
    login=json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/Books"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It Exists!')
else:
    create_database(connection)
    print('Database Created!')

It Exists!

## Load Data

In [5]:
# preview the empty tables
q= '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [6]:
#import users data
users = pd.read_csv('../Books/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
#import authors data
authors = pd.read_csv("../Books/authors - authors.csv")
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [8]:
#import books data
books = pd.read_csv("../Books/books - books.csv")
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
#import favorites data
favorites = pd.read_csv("../Books/favorites - favorites.csv")
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

## Add Data To Tables

### Users

In [10]:
q='''DESCRIBE users;'''
describe=pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0    users_id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [11]:
#Checking the describe's field names
describe['Field'].values

array(['users_id', 'first_name', 'last_name', 'email'], dtype=object)

In [12]:
#Checking the dataframe's columns
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [13]:
#Change Dataframe's 'id' to 'users_id'
users= users.rename({'id':'users_id'},axis=1)
users.head()

   users_id first_name  last_name                 email
0         1       John        Doe          JD@books.com
1         2      Robin      Smith       Robin@books.com
2         3     Gloria  Rodriguez  grodriquez@books.com

In [14]:
#review sql table's data types
describe[['Field','Type']]

        Field         Type
0    users_id          int
1  first_name  varchar(45)
2   last_name  varchar(45)
3       email  varchar(45)

In [15]:
#review dataframe's data types
users.dtypes

users_id       int64
first_name    object
last_name     object
email         object
dtype: object

In [19]:
#import data to sql
users.to_sql("users",engine,index=False, if_exists='append')

3

In [21]:
#confirm data has been added
q= '''SELECT * FROM users;'''
pd.read_sql(q,engine)

   users_id first_name  last_name                 email
0         1       John        Doe          JD@books.com
1         2      Robin      Smith       Robin@books.com
2         3     Gloria  Rodriguez  grodriquez@books.com

### Authors

In [16]:
q='''DESCRIBE authors;'''
describe=pd.read_sql(q, engine)
describe

         Field         Type Null  Key Default Extra
0   authors_id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [17]:
#Checking the describe's field names
describe['Field'].values

array(['authors_id', 'author_name'], dtype=object)

In [18]:
#Checking the dataframe's columns
authors.columns

Index(['id', 'author_name'], dtype='object')

In [22]:
#Change Dataframe's 'id' to 'authors_id'
authors= authors.rename({'id':'authors_id'},axis=1)
authors.head()

   authors_id        author_name
0           1       Stephen King
1           2  F.Scott Fitgerald
2           3        Jack London
3           4        Jane Austen
4           5       Mary Shelley

In [23]:
#review sql table's data types
describe[['Field','Type']]

         Field         Type
0   authors_id          int
1  author_name  varchar(45)

In [25]:
#review dataframe's data types
authors.dtypes

authors_id      int64
author_name    object
dtype: object

In [26]:
#import data to sql
authors.to_sql("authors",engine,index=False, if_exists='append')

5

In [28]:
#confirm data has been added
q= '''SELECT * FROM authors;'''
pd.read_sql(q,engine)

   authors_id        author_name
0           1       Stephen King
1           2  F.Scott Fitgerald
2           3        Jack London
3           4        Jane Austen
4           5       Mary Shelley

### Books

In [29]:
q='''DESCRIBE books;'''
describe=pd.read_sql(q, engine)
describe

       Field         Type Null  Key Default Extra
0   books_id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

In [30]:
#Checking the describe's field names
describe['Field'].values

array(['books_id', 'title', 'author_id'], dtype=object)

In [31]:
#Checking the dataframe's columns
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [32]:
#Change Dataframe's 'id' to 'books_id'
books= books.rename({'id':'books_id'},axis=1)
books.head()

   books_id                 title  author_id
0         1           The Shining          1
1         2                    It          1
2         3      The Great Gatsby          2
3         4  The Call of the Wild          3
4         5   Pride and Prejudice          4

In [33]:
#review sql table's data types
describe[['Field','Type']]

       Field         Type
0   books_id          int
1      title  varchar(45)
2  author_id          int

In [34]:
#review dataframe's data types
books.dtypes

books_id      int64
title        object
author_id     int64
dtype: object

In [35]:
#import data to sql
books.to_sql("books",engine,index=False, if_exists='append')

6

In [36]:
#confirm data has been added
q= '''SELECT * FROM books;'''
pd.read_sql(q,engine)

   books_id                 title  author_id
0         1           The Shining          1
1         2                    It          1
2         3      The Great Gatsby          2
3         4  The Call of the Wild          3
4         5   Pride and Prejudice          4
5         6          Frankenstein          5

### Favorites

In [37]:
q='''DESCRIBE favorites;'''
describe=pd.read_sql(q, engine)
describe

     Field Type Null  Key Default Extra
0  book_id  int   NO  MUL    None
1  user_id  int   NO  MUL    None

In [38]:
#Checking the describe's field names
describe['Field'].values

array(['book_id', 'user_id'], dtype=object)

In [39]:
#Checking the dataframe's columns
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [40]:
#switch the order of the columns
columns_titles = ["book_id","user_id"]
favorites=favorites.reindex(columns=columns_titles)

In [41]:
#check to see if switch worked
favorites.columns

Index(['book_id', 'user_id'], dtype='object')

In [42]:
#review sql table's data types
describe[['Field','Type']]

     Field Type
0  book_id  int
1  user_id  int

In [43]:
#review dataframe's data types
favorites.dtypes

book_id    int64
user_id    int64
dtype: object

In [44]:
#import data to sql
favorites.to_sql("favorites",engine,index=False, if_exists='append')

7

In [45]:
#confirm data has been added
q= '''SELECT * FROM favorites;'''
pd.read_sql(q,engine)

   book_id  user_id
0        1        1
1        2        1
2        3        1
3        4        2
4        5        2
5        5        3
6        6        3

## Show Tables

In [46]:
q='''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Testing The Database

In [47]:
q='''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.books_id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.users_id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));'''
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1